import './App.css';
import React, { useState } from 'react';

function CopyList() {
  const [copiedIndex, setCopiedIndex] = useState(-1);
  const [showSuccess, setShowSuccess] = useState(false);
 const phrases = [
  "اهلا بحضرتك يافندم استفسار حضرتك على الرقم",
  "اهلا بحضرتك يافندم ممكن الرقم الارضي بالاضافه لكود المحافظه",
  "بنعتذر لحضرتك جدا لحظات اقوم بفحص الخط",
  "فى اى تلصيحات حصلت على خط حضرتك اخر 7 ايام؟ من ضمن التغيرات تغير راوتر او اسبليتر؟",
  "حضرتك موصل مباشر بدون اسبلتير من الرئيسي علطول مظبوط؟",
  "تمام حضرتك هو فعلا فى مشكله فنيه ظاهره من خلال الفحص وهصعد شكوي لحضرتك. متاح عدة تلفون ارضي مع حضرتك حاليا؟",
  "موديل راوتر حضرتك H168N؟ لو حضرتك مش متاكد منه استئذن حضرتك تتاكدلى منه بيكون مكتوب فى ضهر الراوتر",
  "رقم الشكوى 102753520 هيتم حل المشكله خلال يوم وهيتم المتابعه من خلال مكالمة او رسالة او رسالة صوتية وإصلاح المشكلة وتغيير السلك الرئيسي سيكون بدون أي رسوم والفني غير مسؤول عن التوصيلات الداخلية أو تغيير أي جهاز مثل الراوتر أو ال Splitter",
  "تم الشحن بنجاح وتقدر تشحن حضرتك باستخدام كروت الشحن عن طريق خدمة العملاء او عن طريق الـ IVR",
  "بنعتذر جدا لحضرتك هو للأن الرصيد ماوصلش على خط حضرتك وبعتذر عن التأخير وهو تأخير غير مقصود وفى خلال ساعة بإذن الله الرصيد هيوصل على خط حضرتك بنجاح ولو الرصيد ماوصلش شرفنا بالتواصل وهنساعد حضرتك",
  "متفهم انزعاج ولكن بإذن الله مش هيكون فى تأخير نهائي فى انتهاء العطل لأنه يعتبر شارف على الانتهاء واحنا كلنا تحت أمرك فى أى وقت",
  "استئذن حضرتك تتأكد من حالة الحرارة",
  "استئذن حضرتك من أي موبايل متاح تتصل على الرقم الأرضي ونشوف فى الموبايل هيدي جرس ولا رسالة صوتية ولا مشغول بحيث نتأكد ان الخط من السنترال شغال طبيعي وهيرن فى الموبايل عادى حتى لو مفيش عدة تليفون عند حضرتك",
  "حضرتك معايا؟ لشات هيفصل تلقائيا بعد 20 ثانية ولو فى أى استفسار تقدر تشرفنا مرة تانية",
  "ممكن حضرتك توضحلى حالة لمبة DSL منورة ولا فاصلة؟",
  "ممكن مراجعة الاسم بالكامل واخر 7 ارقام من البطاقه ومع التجديد المبكر هيتم خسارة اى جيجات متبقيه او صلاحية الباقه",
  "تم تجديد الباقه بنجاح وتقدر تجدد من الموقع او التطبيق او 111 من نفس رقم الخدمه"
  ]
  function handleCopy(index) {
    navigator.clipboard.writeText(phrases[index]);
    setCopiedIndex(index);
    setShowSuccess(true);
    setTimeout(() => setShowSuccess(false), 2000);
  }

  return (
    <>
    {showSuccess && <div className='alert-success'>تم النسخ بنجاح!</div>}
    <ul>
      {phrases.map((phrase, index) => (
        <li key={index}>
          <button className='button' onClick={() => handleCopy(index)}>
            {copiedIndex === index ? 'تم النسخ!' : 'نسخ'}
          </button>
          {" "}{phrase}
          
        </li>
        
      ))}
         
    </ul>
    </>
  );
}



function App() {

  return (
    <div className="App">
      <CopyList  />
    </div>
  );
}

export default App;
